app/controllers/admin/articles_controller.rb

  def index
    @articles = Article.all
    @featured_articles = Article.find(:all, :conditions => "exclusive = true", :limit => 2, :order => "updated_at DESC")
---
SELECT `articles`.* FROM `articles`
SELECT `articles`.* FROM `articles` WHERE (exclusive = true) ORDER BY updated_at DESC LIMIT 2