app/controllers/admin/user_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 3)
---
  def destroy
    @user = User.find(params[:id])
    if @user.delete