app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
SELECT `articles`.* FROM `articles` WHERE (exclusive = true) ORDER BY updated_at DESC LIMIT 2
---
  def index
    @articles = Article.all
    @featured_articles = Article.find(:all, :conditions => "exclusive = true", :limit => 2, :order => "updated_at DESC")

SELECT `articles`.* FROM `articles` WHERE (`articles`.`id` = 1) LIMIT 1
SELECT `articles`.* FROM `articles` LIMIT 5
---
  def show
    @article = Article.find(params[:id])
    @articles = Article.all(:limit => 5)

INSERT INTO `articles` (`asset_content_type`, `asset_file_name`, `asset_file_size`, `asset_updated_at`, `body`, `created_at`, `exclusive`, `title`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, 'kmsdnjhf', '2010-10-22 09:30:18', 0, 'Affe pinkelt', '2010-10-22 09:30:18')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT `articles`.* FROM `articles` WHERE (`articles`.`id` = 3) LIMIT 1
DELETE FROM `articles` WHERE (`articles`.`id` = 3)
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy