app/controllers/user_controller.rb

  def destroy
    @user = User.find(params[:id])
    if @user.delete
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 4)